/* Внесение данных */

INSERT INTO singers (name)
VALUES
('Луиз Армстронг'),
('Гари Дэвис'),
('Анна Бутурлина'),
('Цой'),
('Юрий Шевчук'),
('Богдан Титомир'),
('Дима Билан'),
('Юрий Лоза'),
('Сергей Наговицын');

INSERT INTO genres (name)
VALUES
('Блюз и джаз'),
('Рок'),
('Электронная музыка'),
('Поп'),
('Кантри'),
('Шансон');

INSERT INTO singers_genres
VALUES
(10, 1),
(11, 1),
(12, 1),
(13, 2),
(14, 2),
(15, 3),
(16, 4),
(16, 4),
(17, 3),
(17, 5),
(18, 6);

INSERT INTO albums (name, release_year)
VALUES
('What A Wonderful World', '1967'),
('Louis Armstrong Meets Oscar Peterson', '1957'),
('Reverent Gary Davis Say No to the Devil', '2013'),
('Холодное сердце', '2013'),
('Звезда по имени Солнце', '1989'),
('Группа крови', '1988'),
('Актриса весна', '1992'),
('Высокая энергия', '1992'),
('Я ночной хулиган', '2003'),
('Эгоист', '2018'),
('Концерт для друзей', '1984'),
('Что сказано , то сказано', '1995'),
('Мой приговор', '1998');


INSERT INTO singers_albums (singer_id, album_id)
VALUES
(10, 1),
(10, 2),
(11, 3),
(12, 4),
(13, 5),
(13, 6),
(14, 7),
(15, 8),
(16, 9),
(16, 10),
(17, 11),
(17, 12),
(18, 13);

INSERT INTO tracks (album_id, name, duration)
VALUES
(1, 'What a Wonderful World', '03:45'),
(1, 'Cabaret', '03:56'),
(2, 'That Old Feeling (Lew Brown, Sammy Fain)', '02:42'),
(3, 'Say No to the Devil', '04:01'),
(3, 'Little Bitty Baby', '04:33'),
(4, 'Сердце льда', '01:34'),
(4, 'Это моя любовь', '02:04'),
(4, 'Впервые', '03:43'),
(5, 'Песня без слов', '05:07')
(5, 'Звезда по имени солнце', '03:46'),
(5, 'Невеселая песня', '04:21'),
(6, 'Закрой за мной дверь, я ухожу', '04:17'),
(6, 'Группа крови', '04:46'),
(7, 'Дождь', '05:04'),
(7, 'В последнюю осень', '04:47'),
(8, 'Делай как я', '05:40'),
(8, 'Секс-машина', '03:42'),
(8, 'Девочка в красном', '04:44'),
(9, 'Я ночной хулиган', '03:15'),
(9, 'Звёздочка моя ясная', '04:01'),
(10, 'Эгоист', '02:15'),
(10, 'Белая магия', '03:25'),
(11, 'Иду в компанию', '03:55'),
(11, 'Новый год', '04:15'),
(12, 'Девочка в баре', '03:26'),
(12, 'У моей зазнобы', '04:25'),
(13, 'Приговор', '08:11'),
(13, 'Сизый', '05:33');

INSERT INTO collections (name, release_year)
VALUES
('Для танцев', '2020'),
('Для веселья', '2018'),
('Послушать перед сном', '2022'),
('Для расслабления', '2021'),
('Для души', '2017'),
('Лучшие песни для отдыха', '2018'),
('Не просто музыка', '2017'),
('Не забываемое', '2016');

INSERT INTO tracks_collections (track_id, collection_id)
VALUES
(1, 1),
(2, 1),
(4, 1),
(3, 2),
(5, 2),
(25, 2),
(18, 3),
(28, 3),
(27, 3),
(20, 3),
(7, 4),
(4, 4),
(10, 4),
(14, 4),
(11, 5),
(17, 5),
(19, 5),
(16, 6),
(23, 6),
(22, 6),
(21, 7),
(22, 7),
(15, 7),
(18, 7),
(4, 8),
(22, 8),
(12, 8),
(19, 8)